-- present_listテーブルへのダミーデータ登録
INSERT INTO present_list (present, address) VALUES 
(4, '東京都新宿区西新宿1-2-3'),
(2, '大阪府大阪市北区梅田3-4-5'),
(3, '神奈川県横浜市中区本町6-7-8'),
(1, '愛知県名古屋市中村区名駅9-10-11'),
(5, '北海道札幌市中央区北1条西12-13-14'),
(5, '福岡県福岡市博多区中洲15-16-17'),
(2, '京都府京都市中京区四条通18-19-20'),
(3, '兵庫県神戸市中央区港町21-22-23'),
(4, '千葉県千葉市美浜区打瀬24-25-26'),
(5, '埼玉県さいたま市大宮区桜木町27-28-29'),
(6, '静岡県静岡市葵区呉服町30-31-32'),
(1, '茨城県水戸市南町33-34-35'),
(2, '広島県広島市中区紙屋町36-37-38'),
(3, '宮城県仙台市青葉区中央39-40-41'),
(4, '新潟県新潟市中央区東大通42-43-44'),
(5, '長野県長野市南千歳町45-46-47'),
(6, '岡山県岡山市北区駅元町48-49-50'),
(1, '栃木県宇都宮市馬場通51-52-53'),
(2, '群馬県前橋市千代田町54-55-56'),
(3, '沖縄県那覇市久茂地57-58-59'),
(4, '鹿児島県鹿児島市金生町60-61-62'),
(5, '熊本県熊本市中央区下通63-64-65'),
(6, '大分県大分市府内町66-67-68'),
(1, '長崎県長崎市浜町69-70-71'),
(3, '青森県青森市新町72-73-74'),
(3, '秋田県秋田市中通75-76-77'),
(3, '山形県山形市香澄町78-79-80'),
(5, '福島県福島市栄町81-82-83'),
(6, '岐阜県岐阜市神田町84-85-86'),
(6, '富山県富山市桜町87-88-89');

-- present_nameテーブルへのデータ登録
INSERT INTO present_name (name) VALUES('ぬいぐるみ');
INSERT INTO present_name (name) VALUES('グローブ');
INSERT INTO present_name (name) VALUES('ブロック');
INSERT INTO present_name (name) VALUES('ゲームソフト');
INSERT INTO present_name (name) VALUES('本');
INSERT INTO present_name (name) VALUES('自転車');


-- 認証テーブルへのダミーデータの追加
INSERT INTO authentications (username, password) VALUES ('santa', '$2a$10$WVJkX7dImCUMItAg5DZYx.YE/nm8Txo6W7Woshkcc1GqZKllWXAne');